podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/AIPS_S32K148.svd.xml
<!--
Devices using this peripheral: 
      S32K148
-->
      <peripheral>
         <?sourceFile "AIPS_S32K148" ?>
         <name>AIPS</name>
         <description>AIPS-Lite Bridge</description>
         <groupName>AIPS</groupName>
         <headerStructName>AIPS</headerStructName>
         <baseAddress>0x40000000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MPRA</name>
               <description>Master Privilege Register A</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x77700000</resetValue>
               <fields>
                  <field>
                     <name>MPL2</name>
                     <description>Master 2 Privilege Level</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from this master are forced to user-mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from this master are not forced to user-mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MTW2</name>
                     <description>Master 2 Trusted For Writes</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This master is not trusted for write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This master is trusted for write accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MTR2</name>
                     <description>Master 2 Trusted For Read</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This master is not trusted for read accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This master is trusted for read accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="MPL2" > <name>MPL1</name> <description>Master 1 Privilege Level</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="MTW2" > <name>MTW1</name> <description>Master 1 Trusted for Writes</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="MTR2" > <name>MTR1</name> <description>Master 1 Trusted for Read</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="MPL2" > <name>MPL0</name> <description>Master 0 Privilege Level</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="MTW2" > <name>MTW0</name> <description>Master 0 Trusted For Writes</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="MTR2" > <name>MTR0</name> <description>Master 0 Trusted For Read</description> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PACRA</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x20</addressOffset>
               <resetValue>0x54000000</resetValue>
               <fields>
                  <field>
                     <name>TP1</name>
                     <description>Trusted Protect</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP1</name>
                     <description>Write Protect</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP1</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP1" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP1" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP1" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PACRB</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x24</addressOffset>
               <resetValue>0x44000400</resetValue>
               <fields>
                  <field>
                     <name>TP5</name>
                     <description>Trusted Protect</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP5</name>
                     <description>Write Protect</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP5</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP5" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP5" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP5" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP5" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP5" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP5" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PACRC</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>PACRD</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0x44000000</resetValue>
               <fields>
                  <field>
                     <name>TP1</name>
                     <description>Trusted Protect</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP1</name>
                     <description>Write Protect</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP1</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP1" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP1" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP1" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>OPACRA</name>
               <description>Off-Platform Peripheral Access Control Register</description>
               <addressOffset>0x40</addressOffset>
               <resetValue>0x44004444</resetValue>
               <fields>
                  <field>
                     <name>TP7</name>
                     <description>Trusted Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP7</name>
                     <description>Write Protect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP7</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP7" > <name>TP6</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP6</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>OPACRB</name>
               <description>Off-Platform Peripheral Access Control Register</description>
               <addressOffset>0x44</addressOffset>
               <resetValue>0x44440</resetValue>
               <fields>
                  <field>
                     <name>TP6</name>
                     <description>Trusted Protect</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP6</name>
                     <description>Write Protect</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP6</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP6" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP6" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP6" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP6" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP6" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP6" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP6" > <name>TP3</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="WP6" > <name>WP3</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SP6" > <name>SP3</name> <bitOffset>18</bitOffset> </field>
               </fields>
            </register>
